# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [3]:
cars1 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv")

cars2 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv")

In [4]:
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN

In [5]:
cars2.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,33.0,4,91,53,1795,17.4,76,3,honda civic
1,20.0,6,225,100,3651,17.7,76,1,dodge aspen se
2,18.0,6,250,78,3574,21.0,76,1,ford granada ghia
3,18.5,6,250,110,3645,16.2,76,1,pontiac ventura sj
4,17.5,6,258,95,3193,17.8,76,1,amc pacer d/l

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [6]:
cars1.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model', 'origin', 'car', 'Unnamed: 9', 'Unnamed: 10',
       'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13'],
      dtype='object')

In [7]:
cars1 = cars1.loc[:, 'mpg':'car']

In [8]:
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [10]:
cars1.shape[0]

198

In [12]:
cars2.shape[0]

200

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [13]:
cars = cars1.append(cars2)

In [15]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [16]:
import numpy as np

In [25]:
random_num = np.random.randint(low=15000, high=73001, size=cars.shape[0])

In [26]:
random_num

array([30026, 36944, 47454, 69350, 65033, 36178, 36041, 66792, 45113,
       51742, 29919, 67346, 58066, 64290, 50497, 68840, 32865, 20427,
       46880, 61627, 61338, 20749, 50140, 47718, 61930, 16132, 15624,
       55660, 42105, 17802, 65362, 23356, 23424, 17532, 18301, 22173,
       54212, 38466, 49481, 55247, 66694, 66715, 45261, 50502, 66326,
       32431, 50118, 18894, 65648, 35701, 67498, 67532, 43138, 60047,
       55677, 28532, 61935, 37104, 69037, 40164, 66797, 52406, 51509,
       27641, 26042, 28456, 65590, 46786, 45843, 50459, 60352, 55787,
       65464, 39039, 15008, 61715, 34297, 29146, 30976, 69077, 66463,
       60529, 66405, 22588, 35139, 37340, 72406, 56059, 66574, 54006,
       46126, 15298, 70624, 28238, 55401, 44657, 18357, 29980, 36992,
       57279, 67272, 61929, 28814, 51882, 18658, 28150, 27482, 68720,
       17150, 60448, 65837, 51797, 43122, 70064, 40283, 52362, 71620,
       23477, 63379, 66472, 45487, 20289, 65704, 26968, 67987, 62019,
       50427, 62900, 37070, 34972, 31856, 46571, 34311, 18855, 62975,
       65725, 68430, 45682, 21037, 39092, 25906, 41869, 31531, 71708,
       56302, 30950, 31298, 49259, 69466, 47188, 55538, 60169, 66898,
       47188, 61152, 65399, 41967, 36839, 24291, 71861, 47093, 59341,
       39713, 33952, 66014, 22121, 69491, 22721, 45446, 55553, 18704,
       33345, 43021, 60837, 35260, 36217, 50327, 53281, 44472, 39951,
       26754, 28966, 51791, 28718, 23028, 35122, 28656, 47034, 58975,
       18763, 27641, 19152, 33866, 53554, 29077, 23343, 42063, 50187,
       65188, 53278, 25110, 49291, 54255, 51950, 16856, 15712, 31278,
       44099, 51366, 25783, 65811, 21552, 41570, 47676, 24547, 50087,
       69993, 51599, 16953, 29061, 69874, 42806, 49971, 49019, 44319,
       22158, 25760, 33555, 65005, 30620, 70226, 30111, 52290, 45054,
       63690, 22202, 28489, 29576, 15091, 59990, 25073, 52435, 53810,
       36179, 32623, 45482, 55965, 21356, 24036, 50885, 35011, 22118,
       25169, 55986, 63109, 37057, 25098, 33469, 65805, 46517, 50289,
       50936, 54156, 16558, 47616, 20145, 18984, 70226, 40256, 54340,
       49215, 68857, 55839, 16474, 46890, 62714, 66762, 39252, 36094,
       39728, 35466, 60672, 19729, 27569, 63167, 20532, 34593, 24370,
       72449, 17065, 20976, 28062, 37927, 37833, 53852, 41653, 63311,
       59402, 30040, 72450, 49245, 38473, 29835, 37603, 25480, 22149,
       66520, 36432, 17462, 31160, 17440, 67074, 37001, 40783, 41863,
       25810, 16583, 71558, 45519, 53921, 25376, 59761, 57806, 55931,
       72734, 34144, 55053, 46758, 50918, 54892, 53713, 32063, 38743,
       56870, 21125, 21249, 59423, 34148, 16914, 24549, 33653, 49270,
       66335, 46030, 44906, 29263, 46390, 35635, 54961, 71774, 32168,
       17286, 39763, 72206, 47087, 43684, 28647, 68193, 48384, 21747,
       44297, 48055, 31706, 70715, 65511, 27545, 39526, 60379, 23844,
       18354, 69937, 46302, 31295, 72571, 50786, 66190, 54470, 53059,
       52892, 50084, 66741, 19428, 50928, 38991, 48203, 62441, 41083,
       56317, 36912, 41691, 42382, 17452, 25695, 47742, 57008, 27925,
       47720, 28436])

### Step 8. Add the column owners to cars

In [27]:
cars['owners'] = random_num

In [28]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,30026
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,36944
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,47454
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,69350
4,17.0,8,302,140,3449,10.5,70,1,ford torino,65033